In [ ]:
import pandas as pd

data = {
    "Name": ["Amaan", "Rahul", "Sakshi"],
    "Age": [20, 22, 23]
}

# data frame
df = pd.DataFrame(data)
# print(df)

# df

In [ ]:
# series properties

# 1. homogeneous
s = pd.Series([1, 2, 3, 4, "Amaan"], index=["a", "b", "c", "d", "name"])
# print(s)
# print(s["c"])
# print(s.index)

# 2. vectorized operations
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])

print(s1 + s2)

In [ ]:
s = pd.Series([1, 2, 3, 4, 5])
print(s)

s[5] = 55
print(s)

In [ ]:
# DataFrame

info = {
    "Name": ["Amaan", "Rahul", "Sakshi"],
    "Age": [20, 22, 23],
    "Gpa": [6.29, 7.21, 8.22]
}

df = pd.DataFrame(info)

print(df)

print(type(df))

print(df.index)

print(df.columns)
df

In [ ]:
info = pd.DataFrame([["Amaan", 21], ["atul", 24], ["ram", 26]], columns=["Name", "Age"])
print(info)

print(type(info))

info

In [ ]:
# csv operations

df = pd.read_csv("sample_students_data.csv")

df

In [ ]:
# methods
# df.head(3)
#
# df.tail(2)
#
# df.sample(3)
#
# df.info()

# df.shape

# df.describe()
#
# df.columns

df.nunique()

In [ ]:
# AQI DATASET

df = pd.read_csv("globalAirQuality.csv")

# df.head()
#
# df.tail()
#
# df.sample()
#
# df.info()
#
# df.shape


# df.columns

# df.nunique()

df.describe()

df

In [ ]:
# df[["country", "city"]]

# df.loc[0, "aqi"]

# df.loc[0:0, ["aqi", "country"]]

# df.iloc[0:2, [0, 1]]

# df.at[0, "city"]

# original data prevent to change using .copy()
cities = df["city"].copy()
cities[0] = "New York"

cities

In [ ]:
# filtering data

filteredData = df[df["aqi"] > 144][["city", "aqi"]]

# filteredData
# filteredData.iloc[0]
filteredData.loc[3]

In [ ]:
df = pd.read_csv("raw_data.csv")

df

In [ ]:
df.isnull()
df.isna()

df.isnull().sum()

df.dropna()
df.dropna(axis=1)

missing_values = {
    'name': 'Amaan',
    'age': 22,
    'country': 'India',
    'gender': 'Male',
    'income': df['income'].mean()
}

df.fillna(missing_values).copy()

df.ffill()

df.bfill()

In [ ]:
# Handle-Duplicates

df[['name', 'gender']].duplicated()
df['income'].duplicated()

df.duplicated()
df2 = df.copy()  # copy of original dataFrame
df.drop_duplicates()

In [ ]:
# handle data types


# df['age'] = df['age'].fillna(0).astype(int)
df.dtypes
# df['age']

In [ ]:
df

In [ ]:
df = pd.read_csv('globalAirQuality.csv')

df

In [ ]:
# date-time

df['timestamp'] = pd.to_datetime(df['timestamp'])

df['timestamp'].dtypes

In [ ]:
# handling strings

df = pd.read_csv("raw_data.csv")

df

In [ ]:
# String methods
df['name'].str.lower()
df['name'].str.upper()
df['name'].str.capitalize()
df['country'].str.title()

df['name'].str.split(" ")

df['country'].str.contains("US")
df['country'].str.contains('india', case=False)  # just checks value without any case sensitivity

In [ ]:
df = pd.read_csv("raw_data.csv")

df2 = df.copy()

# map method
df2['gender'] = df2['gender'].map({'Male': 'M', 'Female': 'F', 'Unknown': 'U'})

# assign method
df2.assign(new_income=df2['income'] * 1.1)

# replace method
df2["country"] = df2["country"].replace('USA', 'United States of America')

df2["country"]

In [191]:
# df2['tax'] = df2['income'].apply(lambda x: "20%" if x >= 50000 else "10%")

df2 = df2.rename(columns={"income": "salary"})

sorted_df = df2.sort_values('salary')

sorted_df.sort_index()

sorted_df['ranking'] = sorted_df['salary'].rank(method='dense')

df2 = sorted_df

df2

    id          name   age country   gender   salary  ranking
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      1.0
3    3          Alex   NaN     USA  Unknown  47000.0      2.0
5    5        Li Wei  27.0   China     Male  51000.0      3.0
1    1      John Doe  29.0     USA     Male  55000.0      4.0
0    1      John Doe  29.0     USA     Male  55000.0      4.0
10  10   Emily Davis  31.0     USA      NaN  58000.0      5.0
2    2    Jane Smith   NaN  Canada   Female  62000.0      6.0
8    8    Rachel Lee  29.0     USA   Female  62000.0      6.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0      7.0
6    6           NaN  45.0   India   Female  73000.0      8.0
4    4  Maria Garcia  34.0   Spain   Female      NaN      NaN

In [188]:
df2

    id          name   age country   gender   salary  ranking
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      1.0
3    3          Alex   NaN     USA  Unknown  47000.0      2.0
5    5        Li Wei  27.0   China     Male  51000.0      3.0
1    1      John Doe  29.0     USA     Male  55000.0      5.0
0    1      John Doe  29.0     USA     Male  55000.0      5.0
10  10   Emily Davis  31.0     USA      NaN  58000.0      6.0
2    2    Jane Smith   NaN  Canada   Female  62000.0      8.0
8    8    Rachel Lee  29.0     USA   Female  62000.0      8.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0      9.0
6    6           NaN  45.0   India   Female  73000.0     10.0
4    4  Maria Garcia  34.0   Spain   Female      NaN      NaN